**Consider the following Python dictionary data and Python list labels:**

data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'],
        'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4],
        'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

**1. Create a DataFrame birds from this dictionary data which has the index labels.**

In [1]:
import pandas as pd
import numpy as np
birds = pd.DataFrame({
'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'], 
'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4], 
'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2], 
'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no'],
'labels' : ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']})
birds = birds.set_index('labels')

**2. Display a summary of the basic information about birds DataFrame and its data.**

In [2]:
birds.shape

(10, 4)

**3. Print the first 2 rows of the birds dataframe **

In [3]:
birds.head(2)

         birds  age  visits priority
labels
a       Cranes  3.5       2      yes
b       Cranes  4.0       4      yes

**4. Print all the rows with only 'birds' and 'age' columns from the dataframe**

In [4]:
birds[["birds","age"]]

             birds  age
labels
a           Cranes  3.5
b           Cranes  4.0
c          plovers  1.5
d       spoonbills  NaN
e       spoonbills  6.0
f           Cranes  3.0
g          plovers  5.5
h           Cranes  NaN
i       spoonbills  8.0
j       spoonbills  4.0

**5. select [2, 3, 7] rows and in columns ['birds', 'age', 'visits']**

In [5]:
birds.loc[['c','d','h'],['birds','age','visits']]

             birds  age  visits
labels
c          plovers  1.5       3
d       spoonbills  NaN       4
h           Cranes  NaN       2

**6. select the rows where the number of visits is less than 4**

In [6]:
birds.loc[birds['visits'] < 4]

             birds  age  visits priority
labels
a           Cranes  3.5       2      yes
c          plovers  1.5       3       no
e       spoonbills  6.0       3       no
g          plovers  5.5       2       no
h           Cranes  NaN       2      yes
i       spoonbills  8.0       3       no
j       spoonbills  4.0       2       no

**7. select the rows with columns ['birds', 'visits'] where the age is missing i.e NaN**

In [7]:
birds[['birds','visits']] [birds['age'].isna()]

             birds  visits
labels
d       spoonbills       4
h           Cranes       2

**8. Select the rows where the birds is a Cranes and the age is less than 4**

In [8]:
birds[(birds["birds"] == 'Cranes') & (birds['age'] < 4)]

         birds  age  visits priority
labels
a       Cranes  3.5       2      yes
f       Cranes  3.0       4       no

**9. Select the rows the age is between 2 and 4(inclusive)**

In [9]:
birds[(birds["age"] >= 2) & (birds['age'] <= 4)]

             birds  age  visits priority
labels
a           Cranes  3.5       2      yes
b           Cranes  4.0       4      yes
f           Cranes  3.0       4       no
j       spoonbills  4.0       2       no

**10. Find the total number of visits of the bird Cranes**

In [10]:
birds.loc[birds['birds'] == 'Cranes', 'visits'].sum()

12

**11. Calculate the mean age for each different birds in dataframe.**

In [11]:
cranes_mean = birds.loc[birds['birds'] == 'Cranes', 'age'].mean()
plovers_mean = birds.loc[birds['birds'] == 'plovers', 'age'].mean()
spoonbills_mean = birds.loc[birds['birds'] == 'spoonbills', 'age'].mean()
print(cranes_mean)
print(plovers_mean)
print(spoonbills_mean)

3.5
3.5
6.0

**12. Append a new row 'k' to dataframe with your choice of values for each column. Then delete that row to return the original DataFrame.**

In [12]:
birds_1 = pd.DataFrame({
'birds': ['Cranes'], 
'age': [4], 
'visits': [1], 
'priority': ['yes'],
'labels' : ['k']})
birds_1 = birds_1.set_index('labels')

In [13]:
birds = birds.append(birds_1)
birds

             birds  age  visits priority
labels
a           Cranes  3.5       2      yes
b           Cranes  4.0       4      yes
c          plovers  1.5       3       no
d       spoonbills  NaN       4      yes
e       spoonbills  6.0       3       no
f           Cranes  3.0       4       no
g          plovers  5.5       2       no
h           Cranes  NaN       2      yes
i       spoonbills  8.0       3       no
j       spoonbills  4.0       2       no
k           Cranes  4.0       1      yes

In [14]:
birds = birds.drop(['k'])

**13. Find the number of each type of birds in dataframe (Counts)**

In [15]:
birds.value_counts("birds")

birds
Cranes        4
spoonbills    4
plovers       2
dtype: int64

**14. Sort dataframe (birds) first by the values in the 'age' in decending order, then by the value in the 'visits' column in ascending order.**

In [16]:
birds.sort_values(by = ['age'], ascending = False)

             birds  age  visits priority
labels
i       spoonbills  8.0       3       no
e       spoonbills  6.0       3       no
g          plovers  5.5       2       no
b           Cranes  4.0       4      yes
j       spoonbills  4.0       2       no
a           Cranes  3.5       2      yes
f           Cranes  3.0       4       no
c          plovers  1.5       3       no
d       spoonbills  NaN       4      yes
h           Cranes  NaN       2      yes

In [17]:
birds.sort_values(by = ['visits'], ascending = True)

             birds  age  visits priority
labels
a           Cranes  3.5       2      yes
g          plovers  5.5       2       no
h           Cranes  NaN       2      yes
j       spoonbills  4.0       2       no
c          plovers  1.5       3       no
e       spoonbills  6.0       3       no
i       spoonbills  8.0       3       no
b           Cranes  4.0       4      yes
d       spoonbills  NaN       4      yes
f           Cranes  3.0       4       no

**15. Replace the priority column values with'yes' should be 1 and 'no' should be 0**

In [18]:
birds.replace(['yes','no'], [1,0])

             birds  age  visits  priority
labels
a           Cranes  3.5       2         1
b           Cranes  4.0       4         1
c          plovers  1.5       3         0
d       spoonbills  NaN       4         1
e       spoonbills  6.0       3         0
f           Cranes  3.0       4         0
g          plovers  5.5       2         0
h           Cranes  NaN       2         1
i       spoonbills  8.0       3         0
j       spoonbills  4.0       2         0

**16. In the 'birds' column, change the 'Cranes' entries to 'trumpeters'.**

In [19]:
birds.replace('Cranes', 'trumpeters')

             birds  age  visits priority
labels
a       trumpeters  3.5       2      yes
b       trumpeters  4.0       4      yes
c          plovers  1.5       3       no
d       spoonbills  NaN       4      yes
e       spoonbills  6.0       3       no
f       trumpeters  3.0       4       no
g          plovers  5.5       2       no
h       trumpeters  NaN       2      yes
i       spoonbills  8.0       3       no
j       spoonbills  4.0       2       no